ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2351/device/StdDriver/m2351_sys.h
//PF.1 MFP
#define SYS_GPF_MFPL_PF1MFP_GPIO            (0x0UL<<SYS_GPF_MFPL_PF1MFP_Pos)    /*!< GPF_MFPL PF1 setting for GPIO             */
#define SYS_GPF_MFPL_PF1MFP_X32_IN          (0x1UL<<SYS_GPF_MFPL_PF1MFP_Pos)    /*!< GPF_MFPL PF1 setting for X32_IN           */
#define SYS_GPF_MFPL_PF1MFP_SPI1_MOSI       (0x2UL<<SYS_GPF_MFPL_PF1MFP_Pos)    /*!< GPF_MFPL PF1 setting for SPI1_MOSI        */
#define SYS_GPF_MFPL_PF1MFP_TM3             (0x4UL<<SYS_GPF_MFPL_PF1MFP_Pos)    /*!< GPF_MFPL PF1 setting for TM3              */
#define SYS_GPF_MFPL_PF1MFP_DSRC_TXON       (0x9UL<<SYS_GPF_MFPL_PF1MFP_Pos)    /*!< GPF_MFPL PF1 setting for DSRC_TXON        */

//PF.2 MFP
#define SYS_GPF_MFPL_PF2MFP_GPIO            (0x0UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for GPIO             */
#define SYS_GPF_MFPL_PF2MFP_TAMPER0         (0x1UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for TAMPER0          */
#define SYS_GPF_MFPL_PF2MFP_DAC0_ST         (0x2UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for DAC0_ST          */
#define SYS_GPF_MFPL_PF2MFP_DAC1_ST         (0x3UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for DAC1_ST          */
#define SYS_GPF_MFPL_PF2MFP_TM2_EXT         (0x4UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for TM2_EXT          */
#define SYS_GPF_MFPL_PF2MFP_SPI1_CLK        (0x5UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for SPI1_CLK         */
#define SYS_GPF_MFPL_PF2MFP_PWM0_CH5        (0x6UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for PWM0_CH5         */
#define SYS_GPF_MFPL_PF2MFP_EBI_nCS2        (0x7UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for EBI_nCS2         */
#define SYS_GPF_MFPL_PF2MFP_INT5            (0x8UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for INT5             */
#define SYS_GPF_MFPL_PF2MFP_DSRC_RXON       (0x9UL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for DSRC_RXON        */
#define SYS_GPF_MFPL_PF2MFP_SC0_nCD         (0xAUL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for SC0_nCD          */
#define SYS_GPF_MFPL_PF2MFP_SC1_nCD         (0xBUL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for SC1_nCD          */
#define SYS_GPF_MFPL_PF2MFP_QEI0_A          (0xCUL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for QEI0_A           */
#define SYS_GPF_MFPL_PF2MFP_ECAP1_IC2       (0xDUL<<SYS_GPF_MFPL_PF2MFP_Pos)    /*!< GPF_MFPL PF2 setting for ECAP1_IC2        */

//PF.3 MFP
#define SYS_GPF_MFPL_PF3MFP_GPIO            (0x0UL<<SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for GPIO             */
#define SYS_GPF_MFPL_PF3MFP_XT1_OUT         (0x1UL<<SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for XT1_OUT          */
#define SYS_GPF_MFPL_PF3MFP_I2C1_SCL        (0x3UL<<SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for I2C1_SCL         */
#define SYS_GPF_MFPL_PF3MFP_PWM1_CH4        (0x6UL<<SYS_GPF_MFPL_PF3MFP_Pos)    /*!< GPF_MFPL PF3 setting for PWM1_CH4         */

//PF.4 MFP
#define SYS_GPF_MFPL_PF4MFP_GPIO            (0x0UL<<SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for GPIO             */
#define SYS_GPF_MFPL_PF4MFP_XT1_IN          (0x1UL<<SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for XT1_IN           */
#define SYS_GPF_MFPL_PF4MFP_I2C1_SDA        (0x3UL<<SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for I2C1_SDA         */
#define SYS_GPF_MFPL_PF4MFP_PWM1_CH5        (0x6UL<<SYS_GPF_MFPL_PF4MFP_Pos)    /*!< GPF_MFPL PF4 setting for PWM1_CH5         */

//PF.5 MFP
#define SYS_GPF_MFPL_PF5MFP_GPIO            (0x0UL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for GPIO             */
#define SYS_GPF_MFPL_PF5MFP_ICE_CLK         (0x1UL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for ICE_CLK          */
#define SYS_GPF_MFPL_PF5MFP_UART3_TXD       (0x2UL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for UART3_TXD        */
#define SYS_GPF_MFPL_PF5MFP_UART0_RXD       (0x3UL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for UART0_RXD        */
#define SYS_GPF_MFPL_PF5MFP_I2C0_SCL        (0x4UL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for I2C0_SCL         */
#define SYS_GPF_MFPL_PF5MFP_SC0_DAT         (0x5UL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for SC0_DAT          */
#define SYS_GPF_MFPL_PF5MFP_SD0_nCD         (0xBUL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for SD0_nCD          */
#define SYS_GPF_MFPL_PF5MFP_BPWM1_CH0       (0xDUL<<SYS_GPF_MFPL_PF5MFP_Pos)    /*!< GPF_MFPL PF5 setting for BPWM1_CH0        */

//PF.6 MFP
#define SYS_GPF_MFPL_PF6MFP_GPIO            (0x0UL<<SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for GPIO             */
#define SYS_GPF_MFPL_PF6MFP_ICE_DAT         (0x1UL<<SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for ICE_DAT          */
#define SYS_GPF_MFPL_PF6MFP_UART3_RXD       (0x2UL<<SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for UART3_RXD        */
#define SYS_GPF_MFPL_PF6MFP_UART0_TXD       (0x3UL<<SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for UART0_TXD        */
#define SYS_GPF_MFPL_PF6MFP_I2C0_SDA        (0x4UL<<SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for I2C0_SDA         */
#define SYS_GPF_MFPL_PF6MFP_SC0_CLK         (0x5UL<<SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for SC0_CLK          */
#define SYS_GPF_MFPL_PF6MFP_SD0_CMD         (0xBUL<<SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for SD0_CMD          */
#define SYS_GPF_MFPL_PF6MFP_BPWM1_CH1       (0xDUL<<SYS_GPF_MFPL_PF6MFP_Pos)    /*!< GPF_MFPL PF6 setting for BPWM1_CH1        */

//PF.7 MFP
#define SYS_GPF_MFPL_PF7MFP_GPIO            (0x0UL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for GPIO             */
#define SYS_GPF_MFPL_PF7MFP_TAMPER1         (0x1UL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for TAMPER1          */
#define SYS_GPF_MFPL_PF7MFP_SPI2_I2SMCLK    (0x2UL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for SPI2_I2SMCLK     */
#define SYS_GPF_MFPL_PF7MFP_UART3_TXD       (0x3UL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for UART3_TXD        */
#define SYS_GPF_MFPL_PF7MFP_TM1_EXT         (0x4UL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for TM1_EXT          */
#define SYS_GPF_MFPL_PF7MFP_SPI1_MISO       (0x5UL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for SPI1_MISO        */
#define SYS_GPF_MFPL_PF7MFP_PWM1_CH0        (0x6UL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for PWM1_CH0         */
#define SYS_GPF_MFPL_PF7MFP_EBI_ADR16       (0x7UL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for EBI_ADR16        */
#define SYS_GPF_MFPL_PF7MFP_INT4            (0x8UL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for INT4             */
#define SYS_GPF_MFPL_PF7MFP_EBI_ALE         (0x9UL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for EBI_ALE          */
#define SYS_GPF_MFPL_PF7MFP_SC2_nCD         (0xAUL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for SC2_nCD          */
#define SYS_GPF_MFPL_PF7MFP_USCI0_CLK       (0xBUL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for USCI0_CLK        */
#define SYS_GPF_MFPL_PF7MFP_QEI0_B          (0xCUL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for QEI0_B           */
#define SYS_GPF_MFPL_PF7MFP_ECAP1_IC1       (0xDUL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for ECAP1_IC1        */
#define SYS_GPF_MFPL_PF7MFP_SD0_DAT0        (0xEUL<<SYS_GPF_MFPL_PF7MFP_Pos)    /*!< GPF_MFPL PF7 setting for SD0_DAT0         */

//PF.8 MFP
#define SYS_GPF_MFPH_PF8MFP_GPIO            (0x0UL<<SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for GPIO             */
#define SYS_GPF_MFPH_PF8MFP_TAMPER2         (0x1UL<<SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for TAMPER2          */
#define SYS_GPF_MFPH_PF8MFP_SPI2_CLK        (0x2UL<<SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for SPI2_CLK         */
#define SYS_GPF_MFPH_PF8MFP_TM0_EXT         (0x4UL<<SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for TM0_EXT          */
#define SYS_GPF_MFPH_PF8MFP_PWM1_BRAKE1     (0x5UL<<SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for PWM1_BRAKE1      */
#define SYS_GPF_MFPH_PF8MFP_INT3            (0x8UL<<SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for INT3             */
#define SYS_GPF_MFPH_PF8MFP_QEI0_INDEX      (0xCUL<<SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for QEI0_INDEX       */
#define SYS_GPF_MFPH_PF8MFP_ECAP1_IC0       (0xDUL<<SYS_GPF_MFPH_PF8MFP_Pos)    /*!< GPF_MFPH PF8 setting for ECAP1_IC0        */

//PF.9 MFP
#define SYS_GPF_MFPH_PF9MFP_GPIO            (0x0UL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for GPIO             */
#define SYS_GPF_MFPH_PF9MFP_TAMPER3         (0x1UL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for TAMPER3          */
#define SYS_GPF_MFPH_PF9MFP_SPI2_SS         (0x2UL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for SPI2_SS          */
#define SYS_GPF_MFPH_PF9MFP_UART3_TXD       (0x3UL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for UART3_TXD        */
#define SYS_GPF_MFPH_PF9MFP_TM2             (0x4UL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for TM2              */
#define SYS_GPF_MFPH_PF9MFP_PWM1_BRAKE0     (0x5UL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for PWM1_BRAKE0      */
#define SYS_GPF_MFPH_PF9MFP_PWM1_CH0        (0x6UL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for PWM1_CH0         */
#define SYS_GPF_MFPH_PF9MFP_EBI_ADR16       (0x7UL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for EBI_ADR16        */
#define SYS_GPF_MFPH_PF9MFP_INT2            (0x8UL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for INT2             */
#define SYS_GPF_MFPH_PF9MFP_EADC0_ST        (0x9UL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for EADC0_ST         */
#define SYS_GPF_MFPH_PF9MFP_SC1_RST         (0xBUL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for SC1_RST          */
#define SYS_GPF_MFPH_PF9MFP_QEI1_INDEX      (0xCUL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for QEI1_INDEX       */
#define SYS_GPF_MFPH_PF9MFP_ECAP0_IC2       (0xDUL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for ECAP0_IC2        */
#define SYS_GPF_MFPH_PF9MFP_SD0_DAT0        (0xEUL<<SYS_GPF_MFPH_PF9MFP_Pos)    /*!< GPF_MFPH PF9 setting for SD0_DAT0         */

//PF.10 MFP
#define SYS_GPF_MFPH_PF10MFP_GPIO           (0x0UL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for GPIO            */
#define SYS_GPF_MFPH_PF10MFP_TAMPER4        (0x1UL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for TAMPER4         */
#define SYS_GPF_MFPH_PF10MFP_SPI2_MOSI      (0x2UL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for SPI2_MOSI       */
#define SYS_GPF_MFPH_PF10MFP_UART3_RXD      (0x3UL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for UART3_RXD       */
#define SYS_GPF_MFPH_PF10MFP_TM1            (0x4UL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for TM1             */
#define SYS_GPF_MFPH_PF10MFP_PWM0_BRAKE0    (0x5UL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for PWM0_BRAKE0     */
#define SYS_GPF_MFPH_PF10MFP_PWM1_CH1       (0x6UL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for PWM1_CH1        */
#define SYS_GPF_MFPH_PF10MFP_EBI_ADR17      (0x7UL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for EBI_ADR17       */
#define SYS_GPF_MFPH_PF10MFP_INT1           (0x8UL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for INT1            */
#define SYS_GPF_MFPH_PF10MFP_EBI_nRD        (0x9UL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for EBI_nRD         */
#define SYS_GPF_MFPH_PF10MFP_I2C2_SCL       (0xAUL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for I2C2_SCL        */
#define SYS_GPF_MFPH_PF10MFP_SC1_PWR        (0xBUL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for SC1_PWR         */
#define SYS_GPF_MFPH_PF10MFP_QEI1_A         (0xCUL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for QEI1_A          */
#define SYS_GPF_MFPH_PF10MFP_ECAP0_IC1      (0xDUL<<SYS_GPF_MFPH_PF10MFP_Pos)   /*!< GPF_MFPH PF10 setting for ECAP0_IC1       */

//PF.11 MFP
#define SYS_GPF_MFPH_PF11MFP_GPIO           (0x0UL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for GPIO            */
#define SYS_GPF_MFPH_PF11MFP_TAMPER5        (0x1UL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for TAMPER5         */
#define SYS_GPF_MFPH_PF11MFP_SPI2_MISO      (0x2UL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for SPI2_MISO       */
#define SYS_GPF_MFPH_PF11MFP_UART3_nCTS     (0x3UL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for UART3_nCTS      */
#define SYS_GPF_MFPH_PF11MFP_TM0            (0x4UL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for TM0             */
#define SYS_GPF_MFPH_PF11MFP_PWM0_BRAKE1    (0x5UL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for PWM0_BRAKE1     */
#define SYS_GPF_MFPH_PF11MFP_PWM1_CH2       (0x6UL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for PWM1_CH2        */
#define SYS_GPF_MFPH_PF11MFP_EBI_ADR18      (0x7UL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for EBI_ADR18       */
#define SYS_GPF_MFPH_PF11MFP_INT0           (0x8UL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for INT0            */
#define SYS_GPF_MFPH_PF11MFP_EBI_nWR        (0x9UL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for EBI_nWR         */
#define SYS_GPF_MFPH_PF11MFP_I2C2_SDA       (0xAUL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for I2C2_SDA        */
#define SYS_GPF_MFPH_PF11MFP_SC1_nCD        (0xBUL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for SC1_nCD         */
#define SYS_GPF_MFPH_PF11MFP_QEI1_B         (0xCUL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for QEI1_B          */
#define SYS_GPF_MFPH_PF11MFP_ECAP0_IC0      (0xDUL<<SYS_GPF_MFPH_PF11MFP_Pos)   /*!< GPF_MFPH PF11 setting for ECAP0_IC0       */

//PF.12 MFP
#define SYS_GPF_MFPH_PF12MFP_GPIO           (0x0UL<<SYS_GPF_MFPH_PF12MFP_Pos)   /*!< GPF_MFPH PF12 setting for GPIO            */
#define SYS_GPF_MFPH_PF12MFP_USB_OTG_ID     (0x1UL<<SYS_GPF_MFPH_PF12MFP_Pos)   /*!< GPF_MFPH PF12 setting for USB _OTG_ID     */
#define SYS_GPF_MFPH_PF12MFP_SPI1_MISO      (0x2UL<<SYS_GPF_MFPH_PF12MFP_Pos)   /*!< GPF_MFPH PF12 setting for SPI1_MISO       */
#define SYS_GPF_MFPH_PF12MFP_UART5_RXD      (0x3UL<<SYS_GPF_MFPH_PF12MFP_Pos)   /*!< GPF_MFPH PF12 setting for UART5_RXD       */
#define SYS_GPF_MFPH_PF12MFP_I2C0_SCL       (0x4UL<<SYS_GPF_MFPH_PF12MFP_Pos)   /*!< GPF_MFPH PF12 setting for I2C0_SCL        */
#define SYS_GPF_MFPH_PF12MFP_CAN0_TXD       (0x5UL<<SYS_GPF_MFPH_PF12MFP_Pos)   /*!< GPF_MFPH PF12 setting for CAN0_TXD        */
#define SYS_GPF_MFPH_PF12MFP_USCI1_CTL0     (0xCUL<<SYS_GPF_MFPH_PF12MFP_Pos)   /*!< GPF_MFPH PF12 setting for USCI1_CTL0      */
#define SYS_GPF_MFPH_PF12MFP_PWM1_BRAKE0    (0xDUL<<SYS_GPF_MFPH_PF12MFP_Pos)   /*!< GPF_MFPH PF12 setting for PWM1_BRAKE0     */

//PF.13 MFP
#define SYS_GPF_MFPH_PF13MFP_GPIO           (0x0UL<<SYS_GPF_MFPH_PF13MFP_Pos)   /*!< GPF_MFPH PF13 setting for GPIO            */
#define SYS_GPF_MFPH_PF13MFP_USB_D_P        (0x1UL<<SYS_GPF_MFPH_PF13MFP_Pos)   /*!< GPF_MFPH PF13 setting for USB_D_P        */
#define SYS_GPF_MFPH_PF13MFP_SPI1_MOSI      (0x2UL<<SYS_GPF_MFPH_PF13MFP_Pos)   /*!< GPF_MFPH PF13 setting for SPI1_MOSI       */
#define SYS_GPF_MFPH_PF13MFP_UART5_TXD      (0x3UL<<SYS_GPF_MFPH_PF13MFP_Pos)   /*!< GPF_MFPH PF13 setting for UART5_TXD       */
#define SYS_GPF_MFPH_PF13MFP_I2C0_SDA       (0x4UL<<SYS_GPF_MFPH_PF13MFP_Pos)   /*!< GPF_MFPH PF13 setting for I2C0_SDA        */
#define SYS_GPF_MFPH_PF13MFP_CAN0_RXD       (0x5UL<<SYS_GPF_MFPH_PF13MFP_Pos)   /*!< GPF_MFPH PF13 setting for CAN0_RXD        */
#define SYS_GPF_MFPH_PF13MFP_USCI1_DAT0     (0xCUL<<SYS_GPF_MFPH_PF13MFP_Pos)   /*!< GPF_MFPH PF13 setting for USCI1_DAT0      */

//PF.14 MFP
#define SYS_GPF_MFPH_PF14MFP_GPIO           (0x0UL<<SYS_GPF_MFPH_PF14MFP_Pos)   /*!< GPF_MFPH PF14 setting for GPIO            */
#define SYS_GPF_MFPH_PF14MFP_USB_D_N        (0x1UL<<SYS_GPF_MFPH_PF14MFP_Pos)   /*!< GPF_MFPH PF14 setting for USB_D_N         */
#define SYS_GPF_MFPH_PF14MFP_SPI1_SS        (0x2UL<<SYS_GPF_MFPH_PF14MFP_Pos)   /*!< GPF_MFPH PF14 setting for SPI1_SS         */
#define SYS_GPF_MFPH_PF14MFP_UART5_nCTS     (0x3UL<<SYS_GPF_MFPH_PF14MFP_Pos)   /*!< GPF_MFPH PF14 setting for UART5_nCTS      */
#define SYS_GPF_MFPH_PF14MFP_I2C1_SCL       (0x4UL<<SYS_GPF_MFPH_PF14MFP_Pos)   /*!< GPF_MFPH PF14 setting for I2C1_SCL        */
#define SYS_GPF_MFPH_PF14MFP_USCI1_DAT1     (0xCUL<<SYS_GPF_MFPH_PF14MFP_Pos)   /*!< GPF_MFPH PF14 setting for USCI1_DAT1      */

//PF.15 MFP
#define SYS_GPF_MFPH_PF15MFP_GPIO           (0x0UL<<SYS_GPF_MFPH_PF15MFP_Pos)   /*!< GPF_MFPH PF15 setting for GPIO            */
#define SYS_GPF_MFPH_PF15MFP_USB_VBUS       (0x1UL<<SYS_GPF_MFPH_PF15MFP_Pos)   /*!< GPF_MFPH PF15 setting for USB_VBUS        */
#define SYS_GPF_MFPH_PF15MFP_SPI1_CLK       (0x2UL<<SYS_GPF_MFPH_PF15MFP_Pos)   /*!< GPF_MFPH PF15 setting for SPI1_CLK        */
#define SYS_GPF_MFPH_PF15MFP_UART5_nRTS     (0x3UL<<SYS_GPF_MFPH_PF15MFP_Pos)   /*!< GPF_MFPH PF15 setting for UART5_nRTS      */
#define SYS_GPF_MFPH_PF15MFP_I2C1_SDA       (0x4UL<<SYS_GPF_MFPH_PF15MFP_Pos)   /*!< GPF_MFPH PF15 setting for I2C1_SDA        */
#define SYS_GPF_MFPH_PF15MFP_USCI1_CLK      (0xCUL<<SYS_GPF_MFPH_PF15MFP_Pos)   /*!< GPF_MFPH PF15 setting for USCI1_CLK       */

//PG.1 MFP
#define SYS_GPG_MFPL_PG1MFP_GPIO            (0x0UL<<SYS_GPG_MFPL_PG1MFP_Pos)    /*!< GPG_MFPL PG1 setting for GPIO             */
#define SYS_GPG_MFPL_PG1MFP_SPI0_MISO0      (0x2UL<<SYS_GPG_MFPL_PG1MFP_Pos)    /*!< GPG_MFPL PG1 setting for SPI0_MISO0       */
#define SYS_GPG_MFPL_PG1MFP_UART2_RXD       (0x3UL<<SYS_GPG_MFPL_PG1MFP_Pos)    /*!< GPG_MFPL PG1 setting for UART2_RXD        */
#define SYS_GPG_MFPL_PG1MFP_PWM1_CH2        (0x6UL<<SYS_GPG_MFPL_PG1MFP_Pos)    /*!< GPG_MFPL PG1 setting for PWM1_CH2         */
#define SYS_GPG_MFPL_PG1MFP_EBI_AD7         (0x7UL<<SYS_GPG_MFPL_PG1MFP_Pos)    /*!< GPG_MFPL PG1 setting for EBI_AD7          */
#define SYS_GPG_MFPL_PG1MFP_TM2             (0xBUL<<SYS_GPG_MFPL_PG1MFP_Pos)    /*!< GPG_MFPL PG1 setting for TM2              */

//PG.2 MFP
#define SYS_GPG_MFPL_PG2MFP_GPIO            (0x0UL<<SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for GPIO             */
#define SYS_GPG_MFPL_PG2MFP_SPI0_MOSI0      (0x2UL<<SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for SPI0_MOSI0       */
#define SYS_GPG_MFPL_PG2MFP_UART2_TXD       (0x3UL<<SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for UART2_TXD        */
#define SYS_GPG_MFPL_PG2MFP_PWM1_CH3        (0x6UL<<SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for PWM1_CH3         */
#define SYS_GPG_MFPL_PG2MFP_EBI_AD6         (0x7UL<<SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for EBI_AD6          */
#define SYS_GPG_MFPL_PG2MFP_INT3            (0x8UL<<SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for INT3             */
#define SYS_GPG_MFPL_PG2MFP_TM3_EXT         (0xBUL<<SYS_GPG_MFPL_PG2MFP_Pos)    /*!< GPG_MFPL PG2 setting for TM3_EXT          */

//PG.3 MFP
#define SYS_GPG_MFPL_PG3MFP_GPIO            (0x0UL<<SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for GPIO             */
#define SYS_GPG_MFPL_PG3MFP_SPI0_CLK        (0x2UL<<SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for SPI0_CLK         */
#define SYS_GPG_MFPL_PG3MFP_UART2_nCTS      (0x3UL<<SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for UART2_nCTS       */
#define SYS_GPG_MFPL_PG3MFP_PWM1_CH4        (0x6UL<<SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for PWM1_CH4         */
#define SYS_GPG_MFPL_PG3MFP_EBI_AD5         (0x7UL<<SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for EBI_AD5          */
#define SYS_GPG_MFPL_PG3MFP_INT4            (0x8UL<<SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for INT4             */
#define SYS_GPG_MFPL_PG3MFP_TM3             (0xBUL<<SYS_GPG_MFPL_PG3MFP_Pos)    /*!< GPG_MFPL PG3 setting for TM3              */

//PG.4 MFP
#define SYS_GPG_MFPL_PG4MFP_GPIO            (0x0UL<<SYS_GPG_MFPL_PG4MFP_Pos)    /*!< GPG_MFPL PG4 setting for GPIO             */
#define SYS_GPG_MFPL_PG4MFP_SPI0_SS         (0x2UL<<SYS_GPG_MFPL_PG4MFP_Pos)    /*!< GPG_MFPL PG4 setting for SPI0_SS          */
#define SYS_GPG_MFPL_PG4MFP_UART2_nRTS      (0x3UL<<SYS_GPG_MFPL_PG4MFP_Pos)    /*!< GPG_MFPL PG4 setting for UART2_nRTS       */
#define SYS_GPG_MFPL_PG4MFP_PWM1_CH5        (0x6UL<<SYS_GPG_MFPL_PG4MFP_Pos)    /*!< GPG_MFPL PG4 setting for PWM1_CH5         */
#define SYS_GPG_MFPL_PG4MFP_EBI_AD4         (0x7UL<<SYS_GPG_MFPL_PG4MFP_Pos)    /*!< GPG_MFPL PG4 setting for EBI_AD4          */
#define SYS_GPG_MFPL_PG4MFP_INT5            (0x8UL<<SYS_GPG_MFPL_PG4MFP_Pos)    /*!< GPG_MFPL PG4 setting for INT5             */

//PG.5 MFP
#define SYS_GPG_MFPL_PG5MFP_GPIO            (0x0UL<<SYS_GPG_MFPL_PG5MFP_Pos)    /*!< GPG_MFPL PG5 setting for GPIO             */

//PG.7 MFP
#define SYS_GPG_MFPL_PG7MFP_GPIO            (0x0UL<<SYS_GPG_MFPL_PG7MFP_Pos)    /*!< GPG_MFPL PG7 setting for GPIO             */
#define SYS_GPG_MFPL_PG7MFP_UART0_RXD       (0x3UL<<SYS_GPG_MFPL_PG7MFP_Pos)    /*!< GPG_MFPL PG7 setting for UART0_RXD        */
#define SYS_GPG_MFPL_PG7MFP_EBI_nRD         (0x7UL<<SYS_GPG_MFPL_PG7MFP_Pos)    /*!< GPG_MFPL PG7 setting for EBI_nRD          */
#define SYS_GPG_MFPL_PG7MFP_SC1_CLK         (0xBUL<<SYS_GPG_MFPL_PG7MFP_Pos)    /*!< GPG_MFPL PG7 setting for SC1_CLK          */
#define SYS_GPG_MFPL_PG7MFP_USCI0_DAT0      (0xCUL<<SYS_GPG_MFPL_PG7MFP_Pos)    /*!< GPG_MFPL PG7 setting for USCI0_DAT0       */
#define SYS_GPG_MFPL_PG7MFP_SD0_CLK         (0xEUL<<SYS_GPG_MFPL_PG7MFP_Pos)    /*!< GPG_MFPL PG7 setting for SD0_CLK          */

//PG.8 MFP
#define SYS_GPG_MFPH_PG8MFP_GPIO            (0x0UL<<SYS_GPG_MFPH_PG8MFP_Pos)    /*!< GPG_MFPH PG8 setting for GPIO             */
#define SYS_GPG_MFPH_PG8MFP_SPI1_SS         (0x1UL<<SYS_GPG_MFPH_PG8MFP_Pos)    /*!< GPG_MFPH PG8 setting for SPI1_SS          */
#define SYS_GPG_MFPH_PG8MFP_UART0_TXD       (0x3UL<<SYS_GPG_MFPH_PG8MFP_Pos)    /*!< GPG_MFPH PG8 setting for UART0_TXD        */
#define SYS_GPG_MFPH_PG8MFP_EBI_nWR         (0x7UL<<SYS_GPG_MFPH_PG8MFP_Pos)    /*!< GPG_MFPH PG8 setting for EBI_nWR          */
#define SYS_GPG_MFPH_PG8MFP_SC1_DAT         (0xBUL<<SYS_GPG_MFPH_PG8MFP_Pos)    /*!< GPG_MFPH PG8 setting for SC1_DAT          */
#define SYS_GPG_MFPH_PG8MFP_USCI0_DAT1      (0xCUL<<SYS_GPG_MFPH_PG8MFP_Pos)    /*!< GPG_MFPH PG8 setting for USCI0_DAT1       */
#define SYS_GPG_MFPH_PG8MFP_SD0_DAT3        (0xEUL<<SYS_GPG_MFPH_PG8MFP_Pos)    /*!< GPG_MFPH PG8 setting for SD0_DAT3         */

//PG.9 MFP
#define SYS_GPG_MFPH_PG9MFP_GPIO            (0x0UL<<SYS_GPG_MFPH_PG9MFP_Pos)    /*!< GPG_MFPH PG9 setting for GPIO             */
#define SYS_GPG_MFPH_PG9MFP_UART5_RXD       (0x6UL<<SYS_GPG_MFPH_PG9MFP_Pos)    /*!< GPG_MFPH PG9 setting for UART5_RXD        */
#define SYS_GPG_MFPH_PG9MFP_QEI0_A          (0xCUL<<SYS_GPG_MFPH_PG9MFP_Pos)    /*!< GPG_MFPH PG9 setting for QEI0_A           */

//PG.10 MFP
#define SYS_GPG_MFPH_PG10MFP_GPIO           (0x0UL<<SYS_GPG_MFPH_PG10MFP_Pos)   /*!< GPG_MFPH PG10 setting for GPIO            */
#define SYS_GPG_MFPH_PG10MFP_UART5_TXD      (0x6UL<<SYS_GPG_MFPH_PG10MFP_Pos)   /*!< GPG_MFPH PG10 setting for UART5_TXD       */
#define SYS_GPG_MFPH_PG10MFP_QEI0_B         (0xCUL<<SYS_GPG_MFPH_PG10MFP_Pos)   /*!< GPG_MFPH PG10 setting for QEI0_B          */

